param(
    [string]$ApiKey
)

Set-Location $PSScriptRoot

if (-not $ApiKey) {
    $ApiKey = Read-Host "Enter NuGet API Key"
}

Write-Host @"
███╗   ██╗██╗   ██╗ ██████╗ ███████╗████████╗
████╗  ██║██║   ██║██╔════╝ ██╔════╝╚══██╔══╝
██╔██╗ ██║██║   ██║██║  ███╗█████╗     ██║   
██║╚██╗██║██║   ██║██║   ██║██╔══╝     ██║   
██║ ╚████║╚██████╔╝╚██████╔╝███████╗   ██║   
╚═╝  ╚═══╝ ╚═════╝  ╚═════╝ ╚══════╝   ╚═╝   
"@

dotnet nuget push *.nupkg --api-key $ApiKey --source https://api.nuget.org/v3/index.json

Write-Host "`nPress any key to exit..."
[void][System.Console]::ReadKey($true)
